Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd

In [6]:
 s1 = pd.Series([4,8,15,16,23,42])

In [7]:
print(s1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
#creating the list has 10 elements
l1 =[i for i in range(1,11)]

In [9]:
#creating the pd series ser_list
series = pd.Series(l1)

In [10]:
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
image.png

Name:"Alice", "Bob", "Claire,Age: 25,30,27,
    Gender: "Female", "Male", "Female"

In [11]:
df = pd.DataFrame({"Name":["Alice", "Bob", "Claire"],
    "Age": [25,30,27],
    "Gender": ["Female", "Male", "Female"]})

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.


DataFrame:
Dataframe is a table kind of structure which stores data in tabuler manner. It is a collection of series

Diffrence b/w DataFrame and Series
The Series is the data structure for a single column of a DataFrame
DataFrame is actually stored in memory as a collection of Series.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Data manupulation in pandas can be done through multiple functionalities

addition (+) or substraction (-) or multiplication (*) or division (/) of 2 or more cols

getting average through -- df.col_name.mean()

getting median through -- df.col_name.median()

df.col_name.mode() to get the most frequesnt elements

df.col_name.quantile(.90) to get the quantile

df.describe() to get mean, media, std, 25%, 50% 75% min and max data

df.shape

df.info()

df.dtype

df.drop_duplicates()

df.fillna(0)

etc

In [13]:
#example: 
# suppose we have a data frame having dob and shopping date of product through this we can find out the age of the person

dx={"name":["ram", 'shyam', 'mohan'], "dob":["11-02-1990", "12-3-2001", "04-04-2014"],\
 "purchase_date": ["11-01-2023", "12-05-2023", "04-01-2023"]}
dx=pd.DataFrame(dx) #creation of the dataframe


dx.purchase_date=pd.to_datetime(dx["purchase_date"]).dt.strftime("%Y") # getting the years from the columns
dx.dob=pd.to_datetime(dx["dob"]).dt.strftime("%Y")
dx['Age']=dx["purchase_date"].astype('float')- dx["dob"].astype('float') # getting the age and save the age in new col age
# print the dx
dx

    name   dob purchase_date   Age
0    ram  1990          2023  33.0
1  shyam  2001          2023  22.0
2  mohan  2014          2023   9.0

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable.
The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.
However, the vast majority of methods produce new objects and leave the input data untouched.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
courses = pd.Series(["Spark","PySpark","Hadoop"]) #series1
fees = pd.Series([22000,25000,23000]) # series 2
discount  = pd.Series([1000,2300,1000]) #series 3


# combine multiple series.
df1=pd.concat([courses,fees,discount],axis=1, ) #concat
df1.columns=["name_of_course", "cost", "discount"] #rename the columns
df1

  name_of_course   cost  discount
0          Spark  22000      1000
1        PySpark  25000      2300
2         Hadoop  23000      1000